import React from 'react';



const ClauseContent = () => {
  return (
    <div className="clause-content">
      <h2>러시앤코드 서비스 이용약관</h2>

<h3>제1장 총칙</h3>

<h3>제1조 [목적]</h3>
이 약관은 (주)러시앤코드이 운영하는 러시앤코드 사이트의 이용과 관련하여 (주)러시앤코드과 회원의 권리, 의무 및 책임 사항, 기타 필요한 사항을 규정함을 목적으로 합니다.<br />
<br />
<h3>제2조 [정의]</h3>
본 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br />
① 서비스: 러시앤코드 사이트에서 회원이 이용할 수 있는 질문, 답변, 검색 등 러시앤코드에서 제공되는 모든 서비스를 의미합니다.<br />
② 질문 글: 서비스를 이용하면서 서비스상에 게시한 부호, 문자, 이미지 등의 정보 형태의 글, 사진 및 각종 파일과 링크 등을 의미합니다.<br />
③ 답변 글: 질문 글에 대해 답변하는 이미지, 글 및 각종 파일과 링크 등을 의미합니다.<br />
④ 댓글: 질문 글과 답변 글의 하단에 이용자끼리 주고받는 글을 의미합니다.<br />
⑤ 게시물: 회사의 서비스 내에 이용자가 올린 글, 사진, 그림, 동영상을 비롯한 각종 파일과 링크, 댓글 등의 정보를 의미합니다.<br />
⑥ 회원: 서비스를 이용하는 러시앤코드 사이트와 애플리케이션에 접속하여 이 약관에 따라 이용계약을 체결하고 러시앤코드가 제공하는 서비스를 이용하는 고객을 말합니다.<br />
⑦ 운영자: 서비스의 전반적인 관리와 원활한 운영을 위하여 (주)러시앤코드에서 선정한 사람을 의미합니다.<br />
⑧ 회사: 서비스를 제공하는 회사 (주)러시앤코드을 의미합니다.<br />
<h3>제3조 [약관의 게시 및 개정]</h3>
① 이 약관은 사용자가 다음 중 한가지를 행함으로써 효력이 발생합니다.<br />
1. [가입하기] 페이지를 통해 계정을 만들고 서비스를 이용하는 경우<br />
2. 러시앤코드의 또 다른 서비스인 "코드스테이츠"와 통합된 타 서비스에 가입된 유저가, 사이트 통합 이후 러시앤코드에 로그인한 경우<br />
② 회사는 회원이 별도의 연결 화면을 통하여 약관을 확인할 수 있도록 러시앤코드 웹사이트에 러시앤코드 이용약관을 게시합니다.<br />
③ 회사는 관계 법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.<br />
④ 회사는 약관을 개정할 경우에는 적용 일자 및 개정 사유를 명시하여, 개정 전 약관과 함께 적용일 7일 전부터 러시앤코드 웹사이트에서 확인할 수 있도록 게시합니다.<br />
⑤ 변경된 약관에 동의하지 않는 기존 회원은 서비스 이용을 중단하고 회원을 탈퇴할 수 있습니다.<br />
⑥ 약관이 변경된 이후에도 계속 서비스를 이용하는 경우에는 회원이 약관의 변경 사항에 동의한 것으로 봅니다.<br />
<h3>제4조 [약관의 준칙]</h3>
이 약관에 명시되지 않은 사항이 관계 법령에 규정되어 있으면 그 규정에 따릅니다.<br />
<br />
<br />
<h3>제2장 회원가입과 서비스 이용</h3>
<br />
<h3>제5조 [회원의 회원가입]</h3>
① 회원으로 가입하여 회사가 제공하는 서비스의 이용을 희망하는 자는 약관의 내용을 숙지한 후 동의함을 표시하고, 회사가 제시하는 소정의 회원가입 양식에 관련 사항을 기재하여 회원가입을 신청하여야 합니다.<br />
② 다음 각호에 해당하는 신청에 대하여는 승낙을 하지 않을 수 있으며, 승낙 이후라도 회원가입을 취소할 수 있습니다.<br />
1. 회원가입 신청 시 다른 사람의 명의를 사용하였거나 내용을 허위로 기재한 경우<br />
2. 이전 또는 현재에 본 약관 및 기타 관계 법령을 위반하는 경우<br />
3. 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우<br />
4. 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등의 행위를 하였을 경우<br />
5. 러시앤코드를 이용하여 법령과 본 약관이 금지하는 행위를 하는 경우<br />
6. 기타 회사가 정한 회원가입 요건이 미비할 경우<br />
7. 중복된 아이디를 사용하는 경우<br />
③ 회원이 입력하는 정보는 아래와 같습니다. 아래의 정보 외에 회사는 회원에게 추가 정보의 입력을 요구할 수 있습니다.<br />
- 필수항목 : 이메일, 이름, 비밀번호<br />
④ (주)러시앤코드은 서비스 관련 설비의 여유가 없거나 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.<br />
<h3>제6조 [회원 정보의 변경]</h3>
① 회원은 러시앤코드 웹사이트의 설정 페이지에서 언제든지 자신의 개인정보를 열람하고 수정할 수 있습니다.<br />
② 회사는 회원이 전항의 변경사항을 수정하지 않아 발생한 불이익에 대하여 책임지지 않습니다.<br />
③ 회원이 탈퇴하는 순간부터 회사는 회원의 정보를 이용할 수 없습니다. 다만, 회사는 개인정보보호를 위해 회원이 탈퇴하는 순간부터 1년간 회원의 정보를 보유할 수 있습니다.<br />
<h3>제7조 [회원의 이용계약 해지·해제 등]</h3>
① 회원이 서비스 이용계약을 해지하고자 하는 때에는 언제든지 설정에서 회사가 정한 절차에 따라 회원의 ID를 삭제하고 탈퇴할 수 있습니다.<br />
② 회원이 서비스 이용 계약을 해지할 경우, 회원의 개인정보는 즉시 소멸합니다. 단, 관련법 및 개인정보 보호 정책에 따라 회사가 회원정보를 보유할 수도 있습니다.<br />
③ 계정이 삭제된 후에는 기존 정보를 복구할 수 없습니다.<br />
<h3>제3장 서비스이용</h3>
<br />
<h3>제8조 [회원의 의무]</h3>
회원이 다음 각호에 해당하는 의무를 위반하였을 경우, 기간을 정하여 서비스 이용의 전체 또는 일부를 중지하거나 상당 기간의 최고 후 이용계약을 해지할 수 있습니다. 또한 회사는 의무를 위반한 사항에 대해 필요하다고 판단될 경우 법적 처리 및 사이버수사대 등에 신고할 수 있습니다.<br />
① 아이디와 비밀번호의 관리에 대한 책임은 회원에게 있습니다.<br />
② 회원은 자신의 아이디를 타인에게 양도, 증여, 대여하거나 타인이 사용하게 하여서는 아니 됩니다.<br />
③ 자신의 아이디(ID)가 부정하게 사용된 경우, 회원은 반드시 회사에 그 사실을 통보해야 합니다.<br />
④ 회사는 회원에게 필요한 정보나 광고를 전자메일 등의 방법으로 전달할 수 있으며, 회원은 이를 원하지 않을 경우 프로필수정 메뉴에서 정보수신거부를 할 수 있습니다. 단, 회사는 정보 수신 거부한 회원에게도 중요하다고 판단되는 공지 메일을 보낼 수 있습니다.<br />
<h3>제9조 [서비스 제공 및 변경]</h3>
① 러시앤코드는 연중무휴, 1일 24시간 서비스 제공을 원칙으로 합니다.<br />
② 회사는 운영상 또는 기술상 등의 타당한 이유가 있는 경우 제공하고 있는 서비스를 변경할 수 있습니다.<br />
③ 무료로 제공되는 서비스의 일부 또는 전부는 회사의 정책 및 운영의 필요 상 수정, 중단, 변경할 수 있습니다. 이에 대해 관련법에 특별한 규정이 없는 한 회사는 회원에게 별도의 보상을 하지 않습니다.<br />
④ 전항에 따라 서비스가 변경되는 경우에는 변경되는 사유 및 내용을 회원에게 통지합니다. <br />
<h3>제10조 [정보 제공 및 광고 게재 등]</h3>
① 회사는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 웹사이트 내 게시, 전자우편 등의 방법으로 회원에게 제공할 수 있습니다.<br />
② 회사는 서비스 제공과 관련하여 러시앤코드 웹사이트에 광고를 게재할 수 있습니다.<br />
③ 회사는 서비스상에 개재된 광고주의 판촉 활동에 회원이 참여, 교신 또는 거래하며 발생하는 모든 손실 또는 손해에 대한 책임을 지지 않습니다.<br />
<h3>제11조 [권리의 귀속]</h3>
① 회원이 서비스 내에 게시한 질문 글 및 답변 글의 저작권은 크리에이터 러시앤코드 저작자표시-동일조건변경허락을 따릅니다.<br />
② 회원이 작성한 게시물에 대한 모든 책임은 이를 게시한 회원에게 있습니다.<br />
③ 회원이 서비스 내에 게시하는 게시물은 검색 서비스 및 관련 프로모션 등에 노출될 수 있으며 해당 노출을 위해 필요한 범위 내에서는 일부 수정‧복제‧편집되어 게시될 수 있습니다.<br />
④ (주)러시앤코드은 회원이 서비스 내에 게시한 게시물이 타인의 저작권, 프로그램 저작권 등을 침해하더라도 이에 대한 민‧형사상의 책임을 부담하지 않습니다. 만일 회원이 타인의 저작권, 프로그램 저작권 등을 침해한 이유로 러시앤코드가 타인으로부터 손해배상청구 등 이의 제기를 받은 경우 회원은 러시앤코드의 면책을 위하여 노력하여야 하며, 러시앤코드가 면책되지 못한 경우 회원은 그로 인해 러시앤코드에 발생한 모든 손해를 부담하여야 합니다.<br />
⑤ (주)러시앤코드은 회원이 탈퇴하거나 적법한 사유로 러시앤코드의 회원이 아니게 된 경우, 해당 회원이 게시하였던 게시물을 삭제할 수 있습니다.<br />
<h3>제12조 [회원의 게시물]</h3>
① 회원이 게시하는 정보 및 질문과 대답 등으로 인해 발생하는 손실이나 문제는 전적으로 회원 개인의 판단에 따른 책임이며, 회사의 고의가 아닌 한 회사는 이에 대하여 책임지지 않습니다.<br />
② 회원의 게시물로 인하여 제3자의 회사에 대한 청구, 소송, 기타 일체의 분쟁이 발생한 경우 회원은 그 해결에 드는 비용을 부담하고 회사를 위하여 분쟁을 처리하여야 하며, 회사가 제3자에게 배상하거나 회사에 손해가 발생한 경우 회원은 회사에 배상하여야 합니다.<br />
③ 질문 글을 게시한 회원은 답변 글이 1개 이상 게시된 질문 글을 삭제할 수 없습니다. 또한 삭제에 준하는 내용 편집은 원래 내용으로 복구될 수 있습니다.<br />
④ 회사는 회원의 게시물이 다음 각 항에 해당하는 경우에는 사전통지 없이 삭제합니다. 그러나 회사가 게시물을 검사 또는 검열할 의무를 부담하는 것은 아닙니다.<br />
1. 제3자를 비방하거나 중상 모략하여 명예를 손상하는 경우<br />
2. 공공질서, 미풍양속에 저해되는 내용인 경우<br />
3. 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우<br />
4. 회사에서 규정한 게시 기간을 초과한 경우<br />
5. 상업성이 있는 게시물이나 돈벌이 광고, 행운의 편지 등을 게시한 경우<br />
6. 사이트의 개설취지에 맞지 않을 경우<br />
7. 기타 관계 법령을 위반한다고 판단되는 경우<br />
⑤ 회사는 회원이 등록한 게시물을 활용해 가공, 판매, 출판 등을 할 수 있습니다.<br />
<h3>제13조 [개인정보보호]</h3>
① 회사는 회원의 개인정보보호를 중요시하며, 회원이 회사의 서비스를 이용함과 동시에 온라인상에서 회사에게 제공한 개인정보의 철저한 보호를 위하여 최선을 다하고 있습니다.<br />
② 개인정보보호와 관련된 자세한 사항은 러시앤코드 웹사이트에서 전자적 표시형태로 제공되는 개인정보보호 정책에서 확인할 수 있습니다.<br />
③ 회사는 서비스 제공으로 알게 된 회원의 신상정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 다만, 다음 각호에 해당하는 경우에는 예외로 합니다.<br />
1. 금융실명거래 및 비밀보장에 관한 법률, 신용정보의 이용 및 보호에 관한 법률, 전기통신 기본법, 전기통신사업법, 지방세법, 소비자보호법, 한국은행법, 형사소송법 등 법령에 특별한 규정이 있는 경우<br />
2. 통계작성/학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우<br />
④ 회사는 회원의 전체 또는 일부 정보를 업무와 관련된 통계 자료로 사용할 수 있습니다.<br />
제4장 기타<br />
<br />
<h3>제14조 [면책조항]</h3>
① 회사는 천재지변, 전쟁 또는 그 밖의 불가항력으로 인해 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다. <br />
② 회사는 회원의 귀책사유로 인하여 발생한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다. <br />
③ 회사는 회원이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.<br />
④ 회사는 이용자 상호 간 또는 이용자와 제3자 간에 콘텐츠를 매개로 하여 발생한 분쟁 등에 대하여 책임을 지지 않습니다. <br />
⑤ 회사는 서비스 이용과 관련하여 회사의 고의 또는 중과실이 없는 한 회원에게 발생한 어떠한 손해에 대해서도 책임을 지지 않습니다.<br />
⑥ 회사는 서비스 이용과 관련한 정보, 제품, 서비스, 소프트웨어, 그래픽, 음성, 동영상의 적합성, 정확성, 시의성, 신빙성에 관한 보증 또는 담보책임을 부담하지 않습니다. <br />
<h3>제15조 [분쟁의 해결 등]</h3>
회사와 이용자 간에 발생한 소송의 담당은 제소 당시 이용자의 주소 또는 사는 곳을 담당하는 법원을 전속관할로 합니다. 단, 제소 당시 이용자의 주소 또는 사는 곳이 불분명한 경우에는 민사소송법에 따릅니다.<br />
    </div>
  );
};

export default ClauseContent;
