import React from 'react';



const PrivacyContent = () => {
  return (
    <div className="clause-content">
    <h2>러시앤코드 개인정보 처리방침</h2>

(주)러시앤코드는 『개인정보 보호법』 제30조에 따라 정보 주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 다음과 같이 개인정보 처리지침을 수립, 공개합니다. (주)러시앤코드는 회원의 개인정보보호를 매우 중요시하며, 『정보통신망 이용촉진 등에 관한 법률』 상의 『개인정보보호 규정』 및 정보통신부가 제정한 『개인정보보호 지침』 을 준수하고 있습니다. (주)러시앤코드는 아래와 같이 개인정보 처리방침을 명시하여 러시앤코드에 제공한 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조처를 하는지 알려드립니다. (주)러시앤코드의 개인정보 처리방침은 정부의 법률 및 지침의 변경과 당사의 약관 및 내부 정책에 따라 변경될 수 있으며 이를 개정하는 경우 변경사항에 대하여 즉시 홈페이지에 게시합니다.
본 약관에서 사용하는 용어의 정의는 본 사이트 이용약관의 제2조와 같습니다.

<h3>제1조 [개인정보의 처리 목적]</h3>
개인정보는 생존하는 개인에 관한 정보로서 실명 등의 사항으로 회원 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 식별할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함)를 말합니다. 수집한 개인정보는 다음의 목적을 위해 활용합니다.
① 홈페이지 회원 가입 및 관리
회원 가입 의사 확인, 회원 자격 유지, 회원 자격 관리, 서비스 부정 이용 방지, 각종 고지/통지 등을 목적으로 개인정보를 처리합니다.
② 재화 등 서비스 제공
서비스 제공, 계약서 발송, 청구서 발송, 콘텐츠 제공, 서비스 이용 중에 발생하는 정보의 전달(알림 등)
<h3>제2조 [개인정보의 처리 및 보유 기간]</h3>
러시앤코드 개인정보의 처리 및 보유 기간은 러시앤코드 개인정보 처리방침의 2조 [개인정보의 처리 및 보유 기간]을 따릅니다.

<h3>제3조 [개인정보 제3자에 대한 제공]</h3>
① 회사는 정보 주체의 개인정보를 본 약관 제1조에서 명시한 범위 내에서만 처리하며, 정보 주체의 동의, 법률의 특별한 규정 등 『개인정보 보호법』 제17조(개인정보의 제공)에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.

<h3>제4조 [정보 주체의 권리, 의무 및 행사방법]</h3>
① 정보 주체는 회사에 대해 언제든지 다음 각호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
1. 개인정보 열람 요구
2. 오류 등이 있는 경우 정정요구
3. 삭제 요구
4. 처리 정지 요구
② 본조 제1항에 따른 권리 행사는 러시앤코드 웹사이트, 서면, 전화, 전자우편을 통하여 할 수 있으며 회사는 이에 대해 지체없이 조치하겠습니다.
③ 본조 제1항에 따른 권리 행사는 정보 주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 할 수 있습니다. 이 경우 『개인정보 보호법』에서 정한 서식에 따른 위임장을 제출해야 합니다.
<h3>제5조 [처리하는 개인정보 항목]</h3>
회원은 본 조의 선택 항목 제공 동의를 거부할 권리가 있으며, 미동의 시 서비스 가입/이용에 제약이 있을 수 있고, 미동의한 정보는 제공되지 않습니다.
① 홈페이지 회원 가입 및 관리
1. 필수 항목: 성명, 이메일(아이디), 비밀번호, 소속 기업
② 인터넷 서비스 이용과정에서 IP 주소, 쿠키, 서비스 이용 기록, 방문 기록, 불량 이용 기록 등 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다.

<h3>제6조 [개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항]</h3>
개개인에게 개인화되고 맞춤화된 서비스를 제공하기 위해서 회사는 러시앤코드 사용 정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를 사용합니다. 
쿠키는 웹사이트를 운영하는데 이용되는 서버가 사용자의 브라우저에 보내는 조그마한 데이터 꾸러미로 회원님 컴퓨터의 하드디스크에 저장됩니다.
① 쿠키의 사용 목적
- 회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 관심 분야를 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 횟수 파악 등을 통한 개인 맞춤 서비스 제공
② 쿠키 설정 거부 방법 : 귀하는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 귀하는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.
- 설정 방법 예(인터넷 익스플로러의 경우) : 웹 브라우저 상단의 도구 > 인터넷 옵션 > 개인정보
<h3>제7조 [개인정보의 파기]</h3>
① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
② 정보 주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우, 법령에 따라 해당 개인정보를 보유합니다.
③ 개인정보 파기 절자 및 방법은 다음과 같습니다.
1. 파기절차
- 회사는 파기 사유가 발생한 개인정보를 선정해 개인정보를 파기합니다.
2. 파기방법
- 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제하며, 종이 문서에 기록 및 저장된 개인정보는 분쇄기로 분쇄합니다.
<h3>제8조 [개인정보의 안전성 확보 조치]</h3>
회사는 개인정보의 안전성 확보를 위해 다음과 같은 조처를 하고 있습니다.
① 기술적인 대책
1. 개인정보는 비밀번호에 의해 보호되며, 파일 및 전송 데이터를 암호화하거나 파일 잠금 기능(Lock)을 사용하여 중요한 데이터는 별도의 보안 기능을 통해 보호되고 있습니다.
2. 백신 프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 갑작스러운 바이러스가 출현할 경우 백신이 나오는 즉시 이를 적용함으로써 개인정보가 침해되는 것을 방지하고 있습니다.
3. 회사는 암호알고리즘을 이용하여 네트워크상의 개인정보를 안전하게 전송할 수 있는 보안장치 (SSL)를 채택하고 있습니다.
② 관리적인 대책
1. 회사는 개인정보 취급직원을 개인정보 관리업무를 수행하는 자 및 업무상 개인정보의 취급이 불가피한 자로 엄격히 제한하고 담당 직원에 대한 수시 교육을 통하여 본 정책의 준수를 강조하고 있습니다. 
<h3>제9조 [개인정보 보호 책임자]</h3>
회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개읹어보 처리와 관련한 정보 주체의 불만 처리 및 피해구제 등을 위해 아래와 같이 개인정보 보호 담당 부서를 지정하고 있습니다. 고객의 개인정보와 관련한 문의사항이 있으시면 아래의 개인정보관리책임자에게 연락 주시기 바랍니다.
① 부서명: 러시앤코드 팀
② 담당자: 전한길
③ 연락처: 070-0000-0000
<h3>제10조 [개인정보 처리방침의 변경]</h3>
법률이나 서비스의 변경사항을 반영하기 위한 목적 등으로 개인정보 처리방침을 수정할 수 있습니다.
개인정보 처리방침이 변경되는 경우 변경 사항을 게시하며, 변경된 개인정보 처리방침은 게시한 날로부터 7일 후부터 효력이 발생합니다.
하지만, 피치 못하게 여러분의 권리에 중요한 변경이 있을 경우 변경될 내용을 30일 전에 미리 공지하겠습니다.
    </div>

  );
};

export default PrivacyContent;
